#include <vector>
#include <iostream>

//5. Задані масиви А та В, що містять впорядковані за зростанням цілі числа.
//Утворити масив С, що є об’єднанням масивів А та В зі збереженням
//впорядкованості елементів(самостійно розібрати алгоритм злиття).


int main()
{
	std::cout << "Task 5\n";
	std::vector<int> A = { 50, 51, 52, 53, 54, 55, 56, 57, 58, 59 };
	std::vector<int> B = { 1 };


	A.insert(A.end(), B.begin(), B.end()); // додавання значень вектора Б в кінець вектору А
    std::vector<int> C = A; //копіювання вектора А в вектор С

    // Вивід об'єднаного вектора
    std::cout << "Об'єднаний вектор С: ";
    for (int num : C) //пройти по кожному елементу вектора С
    {
        std::cout << num << " ";
    }
    std::cout << std::endl;

    return 0;
}




